Repository: rikovalkonen/woocommerce-b2b-invoice
Catalog: languages/woocommerce-b2b-invoice-*.po
Languages: fi

source: Add
fi: Lisää

source: Adds a custom WooCommerce payment gateway for B2B customers, allowing invoice-based payments with advanced restrictions and user-specific settings.
fi: Lisää WooCommerceen mukautetun maksutavan yritysasiakkaille, mahdollistaen laskulla maksamisen kehittyneillä rajoituksilla ja käyttäjäkohtaisilla asetuksilla.

source: Allow pay by invoice
fi: Salli maksaminen laskulla

source: Allowed Shipping Methods
fi: Sallitut toimitustavat

source: Bill to company
fi: Lasku yritykselle

source: Business ID
fi: Y-tunnus

source: Choose shipping methods allowed when using this gateway.
fi: Valitse sallitut toimitustavat, kun käytät tätä yhdyskäytävää.

source: Choose the order status to apply when an invoice is used.
fi: Valitse tilauksen tila, joka asetetaan maksun jälkeen.

source: Companies
fi: Yritykset

source: Company
fi: Yritys

source: Company name
fi: Yrityksen nimi

source: Default Order Status
fi: Tilauksen oletustila

source: Delete
fi: Poista

source: Description
fi: Kuvaus

source: E-invoice address
fi: Verkkolaskuosoite

source: Enable Invoice Payment
fi: Ota laskumaksu käyttöön

source: Enable/Disable
fi: Ota käyttöön / Poista käytöstä

source: Intermediary
fi: Välittäjä

source: Invoice payment has been temporarily disabled on your account. Please contact customer service.
fi: Laskulla maksaminen on tilapäisesti poistettu käytöstä tililtäsi. Ota yhteyttä asiakaspalveluun.

source: Invoice reference
fi: Laskun viite

source: Invoice settings
fi: Laskuasetukset

source: No billing companies were found in your account, please contact customer service.
fi: Tililtäsi ei löytynyt laskutusyrityksiä. Otathan yhteyttä asiakaspalveluun.

source: Pay easily by e-invoice. The invoice will be sent to your billing address
fi: Maksa vaivattomasti verkkolaskulla – lasku toimitetaan laskutusosoitteeseesi.

source: Payment by invoice is not allowed on your account.
fi: Tililläsi ei ole oikeutta maksaa laskulla.

source: Reference
fi: Viite

source: Select company
fi: Valitse yritys

source: Temporarily disable invoice payment
fi: Poista laskulla maksaminen tilapäisesti käytöstä

source: This controls the description which the user sees during checkout.
fi: Tämä teksti näkyy käyttäjälle maksutavan valinnan yhteydessä kassalla.

source: This controls the title which the user sees during checkout.
fi: Tämä otsikko näytetään käyttäjälle kassalla maksutapaa valittaessa.

source: Title
fi: Otsikko

source: WooCommerce B2B Invoice
fi: WooCommerce B2B Lasku

source: You are currently unable to use bill pay. Please contact customer service.
fi: Laskulla maksaminen ei ole tällä hetkellä käytettävissä. Ole hyvä ja ota yhteyttä asiakaspalveluun.
